#이 내용은 AI 계층의 추론 내용과 제어 계층을 연결하기 위한 인터페이스를 구현한다.
#문제점은 다음과 같다.
# 1. AI 추론 계층같은 경우 결과 값의 생성 주기가 일정하지 않고 over 1ms의 연산 시간을 요구한다.
# 2. 제어계층은 under 1ms 단위의 제어(실시간 제어)를 요구한다.

# 예시 상황을 알려주자면
# 일반적인 상황에서는 제어계층에는 로봇은 일정한 제어 주기로 정해진 행동을 반복한다.
# 이때 정지 지점 (ex, 직진 선을 따라간다는 로봇에서 선의 끝 지점이 정해지지 않았을 때 vision 기반 AI로 예측한다)을 예측하는 AI를 만들었다고 생각하자.
# AI는 일정 주기 및 1ms 이하의 제어주기를 못따라가므로 정지 신호를 판단하고 보내지만 정지지점 이후의 지점에서 정지를 할 수 있다.
# 이는 실 제조 공정 (ex, 용접)에서는 큰 issue이며 일정하지 않은 성과물을 낸다.
# 이 상황을 제어하기 위해 AI와 제어계층을 보정할 수 있는 기법이 필요하다.

# 원래 문제의 의도는 이러한 상황을 가정한 것 같다.

# 일단 우리는 이러한 문제를 해결하기 위한 방법을 강구한다.

# 우리는 AI 계층이 로봇 Action 자체를 생성한다고 가정을 하였다.
# 우리는 이대로 진행을 할 생각이며 이 부분에서 제어층과 AI층을 분리를 해야할 것 같다.
# AI 계층에서는 선을 잘 따라가며 3D펜이 선 위를 잘 도포하는 모델을 만들것이다.
# 우린 sinusoidal 파형의 선을 따라가는 것으로 할거고 선을 따라가다가 제어주기 마다 벗어나는 정도를 측정 하게 만든다.
# 다만 AI 계층에서 넘어오는 신호는 연속 action 정보를 chunk로 보낼 것이다.
